### simple SQL coding challenge
### Challenge:
#### You are given a table named Products with the following schema:

ProductID	ProductName	Category	Price	Quantity
1	          Laptop	Electronics	1000	5
2	           Phone	Electronics	500	    10
3	           Chair	Furniture	150	    20
4	           Table	Furniture	300	    15
5	         Headphones	Electronics	100	    25

### Task:

#### Write an SQL query to:
	1.	Retrieve all products in the Electronics category with a price greater than $200.
	2.	Calculate the total value of stock for each product (Price * Quantity).
	3.	Display the result in descending order of total value.

In [3]:
import sqlite3
import pandas as pd

In [5]:
# Create an in-memory SQLite database
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

In [7]:
# Create Products table
cursor.execute('''
CREATE TABLE Products (
    ProductID INTEGER PRIMARY KEY,
    ProductName TEXT,
    Category TEXT,
    Price REAL,
    Quantity INTEGER
);
''')

In [9]:
# Insert sample data
products_data = [
    (1, 'Laptop', 'Electronics', 1000, 5),
    (2, 'Phone', 'Electronics', 500, 10),
    (3, 'Chair', 'Furniture', 150, 20),
    (4, 'Table', 'Furniture', 300, 15),
    (5, 'Headphones', 'Electronics', 100, 25)
]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?)", products_data)
conn.commit()

In [11]:
# SQL Query to solve the challenge
query = '''
SELECT ProductName, Category, Price, Quantity, (Price * Quantity) AS TotalValue
FROM Products
WHERE Category = 'Electronics' AND Price > 200
ORDER BY TotalValue DESC;
'''

# Execute and display results
df = pd.read_sql_query(query, conn)
display(df)

# Close connection
conn.close()

  ProductName     Category   Price  Quantity  TotalValue
0      Laptop  Electronics  1000.0         5      5000.0
1       Phone  Electronics   500.0        10      5000.0